Revit 2027 API
ViewShapeBuilder Constructor
 Default constructor for an ViewShapeBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewShapeBuilder()
Public Sub New
public:
ViewShapeBuilder()
new : unit -> ViewShapeBuilder
See Also
Reference
ViewShapeBuilder Class
ViewShapeBuilder Overload
Autodesk.Revit.DB Namespace